Project_reading.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-11 Sun 02:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Project Reading</title>
<meta name="author" content="Pranav Kalsi" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Project Reading</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge6af534">1. Converging point method</a></li>
<li><a href="#org6282d34">2. Reading Paper:</a>
<ul>
<li><a href="#org81abfec">2.1. Photometric, kinematic, and variability study in the young open cluster NGC 1960 </a>
<ul>
<li><a href="#org8fc16d8">2.1.1. Membership determination (Section 4):</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Last modified: <span class="timestamp-wrapper"><span class="timestamp">[2025-05-10 Sat]</span></span>
This file contains the important and relevant things from the reading resources for the project. It also contains doubts which are unresolved.
</p>

<p>
Project progress is maintained here <a href="Progress.html">Progress</a>.
Communication with professor and personal goals is maintained here <a href="Project_update.html">Project<sub>Updates</sub></a>.
</p>
<div id="outline-container-orge6af534" class="outline-2">
<h2 id="orge6af534"><span class="section-number-2">1.</span> Converging point method</h2>
<p>
The method is beautifully explained in this website: <a href="https://physics.weber.edu/palen/clearinghouse/labs/hyades/disthyad.html">https://physics.weber.edu/palen/clearinghouse/labs/hyades/disthyad.html</a>.
</p>
</div>
<div id="outline-container-org6282d34" class="outline-2">
<h2 id="org6282d34"><span class="section-number-2">2.</span> Reading Paper:</h2>
<div id="outline-container-org81abfec" class="outline-3">
<h3 id="org81abfec"><span class="section-number-3">2.1.</span> <a href="Papers/Joshi_2020_MNRAS_492_3602.pdf">Photometric, kinematic, and variability study in the young open cluster NGC 1960</a> </h3>
<div id="outline-container-org8fc16d8" class="outline-4">
<h4 id="org8fc16d8"><span class="section-number-4">2.1.1.</span> Membership determination (Section 4):</h4>
<p>
This section of the paper focuses on the determining the membership probability of a star in the image field, by assuming a few confirmed cluster members.
In general an image will have stars from clusters and foreground as well as background.
Using Gaia DR2, data proper-motion is plotted as Vector Point Diagram (VPD). And the cluster members are assigned by chosing stars which form a dense cluster of points in VPD.
</p>
<blockquote>
<p>
   <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> The centre of the circular region confining the
probable cluster members was determined by maximum density
method in the proper motion plane which is found to lie at (μx , μy )
≡ (μα cosθ, μδ ) ≈ (−0.13, −3.37) mas yr−1 .
The radius of the circle
was derived by plotting the stellar density as a function of radial
distance in the proper motion plane as illustrated in Fig. 2. We fit the stellar density profile with a function similar to the one used to characterize the radial profiles of star clusters in the galaxies.
</p>
</blockquote>
<p>
<b>Membership probability</b>  
</p>
<blockquote>
<p>
\[
P_\mu(i) = \frac{n_c \cdot \phi^v_c(i)}{n_c \cdot \phi^v_c(i) + n_f \cdot \phi^v_f(i)}
\]
\[
\phi^v_c(i) = \frac{1}{2\pi \sqrt{(\sigma_{xc}^2 + \epsilon_{xi}^2)(\sigma_{yc}^2 + \epsilon_{yi}^2)}} \exp\left\{ - \frac{1}{2} \left[ \frac{(\mu_{xi} - \mu_{xc})^2}{\sigma_{xc}^2 + \epsilon_{xi}^2} + \frac{(\mu_{yi} - \mu_{yc})^2}{\sigma_{yc}^2 + \epsilon_{yi}^2} \right] \right\}
\]
</p>

<p>
\[
\phi^v_f(i) = \frac{1}{2\pi \sqrt{1 - \gamma^2} \sqrt{(\sigma_{xf}^2 + \epsilon_{xi}^2)(\sigma_{yf}^2 + \epsilon_{yi}^2)}}
\
\exp\left\{ - \frac{1}{2(1 - \gamma^2)} \left[ \frac{(\mu_{xi} - \mu_{xf})^2}{\sigma_{xf}^2 + \epsilon_{xi}^2} - \frac{2\gamma (\mu_{xi} - \mu_{xf})(\mu_{yi} - \mu_{yf})}{\sqrt{(\sigma_{xf}^2 + \epsilon_{xi}^2)(\sigma_{yf}^2 + \epsilon_{yi}^2)}} - \frac{(\mu_{yi} - \mu_{yf})^2}{\sigma_{yf}^2 + \epsilon_{yi}^2} \right] \right\}
\]
</p>


<p>
\[
\gamma = \frac{(\mu_{xi} - \mu_{xf})(\mu_{yi} - \mu_{yf})}{\sigma_{xf} \sigma_{yf}}
\]
</p>
</blockquote>
<p>
<b>Parallax criteria on membership selection</b>
By measuring the parallax of the stars, we further constrain the cluster members by eliminating all those stars whose parallax is 3&sigma; away from the mean cluster parallax, which is a gaussian. 
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Reffering to figure 1 in (Joshi et al. 2020). 
</p></div></div>


</div>
</div></div>
</body>
</html>